{
    "name": "Harsh Patel.",
    "aboutp1": "I am a full-stack developer with an inclination for machine learning. Currently, I am pursuing my Masters of Applied Computer Science at Dalhousie University, Canada.",
    "aboutme1": "Hey! My name is Harsh Patel and I like developing cool video games and applications.",
    "aboutme2": "My fascination with ethical hackers during high school sparked my early interest in programming. Soon after, I fell in love with Computer Science as I dived deeper into my bachelor's degree.",
    "aboutme3": "Fast forward to today, I have been a part of an amazing fintech startup Quicko as a full stack developer intern and have completed several other internships.",
    "aboutme4": "Following are the few technologies I have used recently: ",
    "techs": [
        "Flutter",
        "TypeScript",
        "ReactJS",
        "NodeJS",
        "Gatsby",
        "Tailwind CSS"
    ],
    "workTitles": [
        "Quicko",
        "Ahmedabad University"
    ],
    "posts": [
        "Full Stack Developer",
        "RA/TA and flutter developer"
    ],
    "timeline": [
        "Dec 2021 - Jun 2022",
        "Aug 2021 - December 2021"
    ],
    "workpointers": [
        [
            "Building and developing PWA for Quicko's product: MEET",
            "Using flutter for front-end development and NodeJS for backend and RESTful apis",
            "Working in a fast-paced start-up environment and building quality product",
            "Communicate with multi-disciplinary teams of engineers, designers and product managers on a daily basis"
        ],
        [
            "Worked as a Teaching Assistant of the Embedded Systems Design course for the Fall'21 semester",
            "Worked as a research fellow under ITS research program during Summer'21 semester",
            "Worked as a flutter developer under UGRP program during Summer'21 semester"
        ]
    ],
    "link": [
        "https://quicko.com/income-tax/meet",
        ""
    ],
    "edoutro": "Honorable Mention: Youtube tutorials",
    "corvitodet": [
        "A MAL and IMDB hybrid.",
        "An interactive website where an user can make and maintain different lists like watched list, currently watching and wishlist."
    ],
    "projects": [
        [
            "Corvito",
            "An interactive website where an user can make and maintain different lists like watched list, currently watching and wishlist.",
            [
                "React JS",
                "HCI"
            ],
            "https://github.com/Harshpatel249/CorVito"
        ],
        [
            "Echos: ASL tutor",
            "An app like Duolingo which teaches the user Sign Language(ASL), it also includes a Sign-Language to Text conversion feature.",
            [
                "Flutter",
                "Firebase"
            ],
            "https://github.com/Harshpatel249/Echos"
        ],
        [
            "Magnar: 2D Platformer Game",
            "A modern version of the Mario Bros where players can create their own levels by editing an image.",
            [
                "Java",
                "Image processing"
            ],
            "https://github.com/Harshpatel249/magnar2d"
        ]
    ]
}